//
//  thirdAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class thirdAnswersViewController: UIViewController {

    @IBOutlet weak var textView: UITextView!
    
    let answer3 = "🤧 يمكن أن يصاب الأشخاص بعدوى مرض كوفيد-19 عن طريق الأشخاص الآخرين المصابين بالفيروس.\n\n 💦 يمكن للمرض أن ينتقل من شخص إلى شخص عن طريق القُطيرات الصغيرة التي تتناثر من الأنف أو الفم عندما يسعل أو يعطس الشخص المصاب بمرض كوفيد-19.\n\n 🥄 تتساقط هذه القُطيرات على الأشياء والأسطح المحيطة بالشخص.\n\n 👈 يمكن حينها أن يصاب الأشخاص الآخرون بمرض كوفيد-19 عند ملامستهم لهذه الأشياء أو الأسطح ثم لمس عينيهم أو أنفهم أو فمهم.\n\n ↔️ كما يمكن أن يصاب الأشخاص بمرض كوفيد-19 إذا تنفسوا القُطيرات التي تخرج من الشخص المصاب بالمرض مع سعاله أو زفيره. ولذا فمن المهم الابتعاد عن الشخص المريض بمسافة تزيد على متر واحد (3 أقدام).\n\n وتعكف المنظمة على تقييم البحوث الجارية بشأن طرق انتشار مرض كوفيد-19 وستواصل نشر أحدث ما تتوصل إليه من نتائج.\n\n هل يمكن للفيروس المسبب لمرض كوفيد-19 أن ينتقل عبر الهواء؟\n تشير الدراسات التي أُجريت حتى يومنا هذا إلى أن الفيروس الذي يسبب مرض كوفيد-19 ينتقل في المقام الأول عن طريق ملامسة القُطيرات التنفسية لا عن طريق الهواء.\n\n هل يمكن أن يصاب المرء بالمرض عن طريق شخص عديم الأعراض؟\n تتمثل الطريقة الرئيسية لانتقال المرض في القُطيرات التنفسية التي يفرزها الشخص عند السعال. وتتضاءل احتمالات الإصابة بمرض كوفيد-19 عن طريق شخص عديم الأعراض بالمرة. ولكن العديد من الأشخاص المصابين بالمرض لا يعانون إلا من أعراض طفيفة. وينطبق ذلك بصفة خاصة على المراحل المبكرة للمرض. ولذا فمن الممكن الإصابة بمرض كوفيد-19 عن طريق شخص يعاني مثلاً من سعال خفيف ولا يشعر بالمرض.\n"
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer3
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
