//
//  sixthAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class sixthAnswersViewController: UIViewController {

    
    @IBOutlet weak var textView: UITextView!
    
    let answer6 = "تدابير الحماية للجميع\n\n ℹ️ اطّلع باستمرار على آخر المعلومات عن فاشية مرض كوفيد-19 المُتاحة على موقع المنظمة الإلكتروني والتي تصدرها سلطة الصحة العمومية الوطنية والمحلية في بلدك. لقد سجّلت بلدان كثيرة في العالم حالات إصابة بمرض كوفيد-19، وشهد العديد منها فاشيات. ولقد نجحت السلطات المعنية في الصين وفي بعض البلدان الأخرى في إبطاء وتيرة انتشار فاشياتها أو وقفها تماما. ونظرا لأنه من الصعب التنبؤ بتطور الوضع، يرجى الاطلاع بانتظام على آخر الأخبار.\n\n يمكنك الحد من احتمال إصابتك بمرض كوفيد-19 أو من انتشاره باتخاذ بعض الاحتياطات البسيطة:\n\n نظف يديك جيداً بانتظام بفركهما بمطهر كحولي لليدين أو بغسلهما بالماء والصابون.\n\n لماذا؟  إن تنظيف يديك بالماء والصابون أو فركهما بمطهر كحولي من شأنه أن يقتل الفيروسات التي قد تكون على يديك.\n ↔️ احتفظ بمسافة لا تقل عن متر واحد (3 أقدام) بينك وبين أي شخص يسعل أو يعطس.\n لماذا؟ عندما يسعل الشخص أو يعطس، تتناثر من أنفه أو فمه قُطيرات سائلة صغيرة قد تحتوي على الفيروس. فإذا كنت شديد الاقتراب منه يمكن أن تتنفس هذه القُطيرات، بما في ذلك الفيروس المسبب لمرض كوفيد-19 إذا كان الشخص مصاباً به.\n🚫 تجنب لمس عينيك وأنفك وفمك.\n لماذا؟ تلمس اليدين العديد من الأسطح ويمكنها أن تلتقط الفيروسات. وإذا تلوثت اليدان فإنهما قد تنقلان الفيروس إلى العينين أو الأنف أو الفم. ويمكن للفيروس أن يدخل الجسم عن طريق هذه المنافذ ويصيبك بالمرض.\n🤧 تأكد من اتّباعك أنت والمحيطون بك لممارسات النظافة التنفسية الجيدة. ويعني ذلك أن تغطي فمك وأنفك بكوعك المثني أو بمنديل ورقي عند السعال أو العطس، ثم التخلص من المنديل المستعمل على الفور.\n لماذا؟ إن القُطيرات تنشر الفيروس. وباتّباع ممارسات النظافة التنفسية الجيدة تحمي الأشخاص من حولك من فيروسات مثل البرد والأنفلونزا وكوفيد-19.\n🏠 إلزم المنزل إذا شعرت بالمرض. إذا كنت مصاباً بالحمى والسعال وصعوبة التنفس، التمس الرعاية الطبية واتصل بمقدم الرعاية قبل التوجه إليه. واتّبع توجيهات السلطات الصحية المحلية.\n لماذا؟ توفر للسلطات الوطنية والمحلية أحدث المعلومات عن الوضع في منطقتك. واتصالك المسبق بمقدم الرعاية الصحية سيسمح له بتوجيهك سريعاً إلى مرفق الرعاية الصحية المناسب. وسيسهم ذلك في حمايتك ومنع انتشار الفيروسات وسائر أنواع العدوى.\n 🧳 اطّلع باستمرار على آخر المعلومات عن بؤر تفشي عدوى كوفيد-19 (المدن أو المناطق المحلية التي ينتشر فيها مرض كوفيد-19 على نطاق واسع). وتجنب السفر إلى هذه الأماكن قدر الإمكان، خصوصا إذا كنت مسنّاً أو مصابًا بداء السكري أو بأحد أمراض القلب أو الرئة.\n لماذا؟ لأن هناك احتمال أكبر أن تصاب بعدوى مرض كوفيد-19 في إحدى هذه المناطق."
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer6
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

}
