//
//  twelveAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class twelveAnswersViewController: UIViewController {

    @IBOutlet weak var textView: UITextView!
    
    let answer12 = "مساعدة الأطفال على التغلب على الشعور بالقلق الناجم عن فاشية مرض كوفيد-19*\n\n 🧒 تختلف استجابة الأطفال للضغوط، فقد يصبح بعضهم أكثر تعلقًا أو قلقًا أو انطواءً أوغضبًا أو تهيجًا، وقد يصل الأمر إلى التّبَوُّل في الفِّراش، وغير ذلك.\n تجاوب مع ردود أفعال طفلك وقدِّّم له الدعم، واستمع إلى مخاوفه، وأحطه بمزيد من الحب والاهتمام.\n 💖 يحتاج الأطفال إلى الشعور بالحب والاهتمام من البالغين في الأوقات العصيبة. فامنحهم المزيد من الوقت والاهتمام. تذكّر أن تستمع إلى طفلك، وتتحدّث إليه بلطف، وتطمئنه. خصص لطفلك مساحة من الوقت للعب والراحة، إن أمكن.\n 👪 ينبغي أن يظل الأطفال بالقرب من والديهم وأسرتهم، ويجب تجنب عزل الأطفال عن القائمين على رعايتهم بقدر الإمكان. وإذا وجب عزل الأطفال عن ذويهم (مثلاً عند إدخالهم إلى المستشفى)، فحافظ على استمرار التواصل بينهم (عبر الهاتف مثلا)، وطمئنهم دائمًا.\n 🪁 حافظ على الروتين اليومي والجداول الزمنية المعتادة بقدر الإمكان، أو ساعد على إنشاء روتين وجداول زمنية جديدة في البيئة الجديدة، بما يشمل الدراسة/التعلُّم، وخصص وقتًا للعب الآمن والراحة.\n ℹ️ وضح حقيقة ما يجري، واشرح ما يحدث الآن، وقدِّّم معلومات واضحة عن كيفية الحدّ من خطر العدوى بعبارات يسهل على الأطفال فهمها وتتناسب مع فئتهم العمرية. ويشمل ذلك تقديم معلومات بطريقة مطمئنة عما يُحتمل حدوثه (مثلاً عندما لا يشعر أحد أفراد الأسرة أو الطفل بصحة جيدة ويضطر للذهاب إلى المستشفى لبعض الوقت حتى يساعد الأطباء على الشعور بصحة أفضل)."
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer12
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
