//
//  elevenAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class elevenAnswersViewController: UIViewController {

    @IBOutlet weak var textView: UITextView!
    
    let answer11 = "📞 من الطبيعي الشعور بالحزن أو القلق أو الارتباك أو الخوف أو الغضب أثناء الأزمات. يساعد التحدث مع أشخاص تثق بهم على التخفيف من هذ المشاعر. فحافظ على التواصل مع أصدقائك وأسرتك.\n\n 🥦 إذا كان لِّزامًا عليك البقاء في المنزل، فاتبع أسلوب حياة صحي - تناول طعاما صحيًا، واحصل على قسطٍ جيدٍ من النوم، ومارس التمارين الرياضية، وتواصل مع أحبائك الموجودين معك في المنزل، ومع الآخرين من أفراد عائلتك وأصدقائك عبر البريد الإلكتروني والهاتف.\n\n 🚭 امتنع عن التدخين أو شرب الكحوليات أو تعاطي المخدرات ولا تستخدمها وسيلة في التغلُّب على المشاعر السلبية. إذا اجتاحتك مشاعر يصعب عليك التحكم فيها، فتحدّث إلى أحد العاملين أو المرشدين الصحيين. وجهِّّز خطة، وحدد أين تذهب وكيف تلتمس المساعدة لتُلبي احتياجاتك الصحية الجسدية والنفسية عند الاقتضاء.\n\n ℹ️ ابحث عن الحقائق. واجمع المعلومات التي تساعدك على تحديد الخطر الذي تتعرض إليه بدقة، حتى يمكنك اتخاذ الاحتياطات المعقولة.وابحث عن مصدر موثوق، مثل الموقع الإلكتروني لمنظمة الصحة العالمية، أو إحدى الهيئات المحلية أو الحكومية للصحة العامة.\n\n😭 تغلب على شعورك بالقلق والهِّياج بالتقليل من الوقت الذي تقضيه أنت وأسرتك في مشاهدة التغطية الإعلامية التي تُسبب لك إزعاجًا أو الاستماع إليها.\n\n⭐️ استجمع مهاراتك التي ساعدتك على إدارة الشدائد التي مررت بها في الماضي، واستخدمها في إدارة مشاعرك في هذه الأوقات الصعبة بسبب الفاشية"
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer11
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
