//
//  eighthAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class eighthAnswersViewController: UIViewController {

    
    
    @IBOutlet weak var textView: UITextView!
    
    let answer8 = "💊  هل المضادات الحيوية فعّالة في الوقاية من مرض كوفيد-19 أو علاجه؟\n لا. لا تقضي المضادات الحيوية على الفيروسات، فهي لا تقضي إلا على العدوى البكتيرية. وبما أن مرض كوفيد-19 سببه فيروس، فإن المضادات الحيوية لا تقضي عليه. فلا ينبغي استعمال المضادات الحيوية كوسيلة للوقاية من مرض كوفيد-19 أو علاجه. ولا ينبغي استعمالها إلا وفقاً لتعليمات الطبيب لعلاج حالات العدوى البكتيرية.\n\n 🧪 هل توجد أي أدوية أو علاجات يمكنها الوقاية من مرض كوفيد-19 أو علاجه؟\n\n في حين قد تريح بعض الأدوية الغربية أو التقليدية أو المنزلية من بعض أعراض كوفيد-19 أو تخففها، فليست هناك بيّنة على وجود أدوية حالياً من شأنها الوقاية من هذا المرض أو علاجه. ولا توصي المنظمة بالتطبيب الذاتي بواسطة أي أدوية، بما في ذلك المضادات الحيوية، سواء على سبيل الوقاية من مرض كوفيد-19 أو معالجته. غير أن هناك عدة تجارب سريرية جارية تتضمن أدوية غربية وتقليدية معاً. وستواصل المنظمة إتاحة معلومات محدّثة بهذا الشأن عندما تتوفر النتائج السريرية.\n💉 هل هناك لقاح أو دواء أو علاج لمرض كوفيد-19؟\n\n ليس بعد. لا يوجد حتى يومنا هذا لقاح ولا دواء محدد مضاد للفيروسات للوقاية من مرض كوفيد-19 أو علاجه. ومع ذلك، فينبغي أن يتلقى المصابون به الرعاية لتخفيف الأعراض. وينبغي إدخال الأشخاص المصابين بمرض وخيم إلى المستشفيات. ويتعافى معظم المرضى بفضل الرعاية الداعمة.\n\n ويجري حالياً تحري بعض اللقاحات المحتملة والأدوية الخاصة بعلاج هذا المرض تحديداً. ويجري اختبارها عن طريق التجارب السريرية. وتقوم المنظمة بتنسيق الجهود المبذولة لتطوير اللقاحات والأدوية للوقاية من مرض كوفيد-19 وعلاجه.\n\n وتتمثل السبل الأكثر فعّالية لحماية نفسك والآخرين من مرض كوفيد-19 في المواظبة على تنظيف اليدين، وتغطية الفم عند السعال بثني المرفق أو بمنديل ورقي، والابتعاد مسافة لا تقل عن متر واحد (3 أقدام) عن الأشخاص الذين يسعلون أو يعطسون."
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer8
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
