//
//  missUnderStandViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class missUnderStandViewController: UIViewController {
    
    let missUnderStand = "هناك الكثير من المعلومات الخاطئة وإليكم الحقائق:\n\n🔢 يمكن أن يُصاب الأشخاص من جميع الأعمار بفيروس كورونا. ويبدو أن كبار السن والأشخاص المصابين بحالات مرضية سابقة الوجود (مثل الرَبْو، وداء السُكَّريّ، وأمراض القلب) هم الأكثر عُرضة للإصابة بمرض وخيم في حال العدوى بالفيروس.\n\n❄️ البرد والثلج لا يمكن أن يقتلا فيروس كورونا\n\n☀️ يستطيع فيروس كورونا أن ينتقل في المناخ الحار والرطب\n\n🦟 لا يمكن أن ينتقل فيروس كورونا عن طريق لدغات البعوض\n\n🐶 في الوقت الحاضر، لا توجد أي بيّنة على أن الحيوانات المرافقة/الأليفة، مثل الكلاب أو القطط، قد تنقل العدوى بفيروس كورونا.\n\n🛀 الاستحمام بالماء الساخن لا يقي من فيروس كورونا\n\n💨 مجففات الأيدي ليست فعَّالة في القضاء على فيروس كورونا.\n\n🟣 ينبغي عدم استخدام مصابيح الأشعة فوق البنفسجية في تعقيم الجلد لأن هذه الأشعة يمكن أن تسبب حساسية للجلد.\n\n🌡️ تعد الماسحات الحرارية فعَّالة في الكشف عن الأشخاص المصابين بالحمى ولكن لا يمكنها تحديد إذا ما كان الشخص مصاب بفيروس كورونا.\n\n💦 لن يقضي رش الجسم بالكحول أو الكلور على الفيروسات التي دخلت جسمك بالفعل.\n\n💉 لا توفر اللقاحات المضادة للالتهاب الرئوي، مثل لقاح المكورات الرئوية ولقاح المستدمية النزلية من النمط ب ، الوقاية من فيروس كوفيد-19.\n\n👃 لا توجد أي بيّنة على أن غسل الأنف بانتظام بمحلول ملحي يقي من العدوى بفيروس كورونا.\n\n🧄 يعد الثوم طعامًا صحيًا ومع ذلك، لا توجد أي بيّنة من الفاشية الحالية تثبت أن تناول الثوم يقي من العدوى بفيروس كورونا.\n\n💊 لا تقضي المضادات الحيوية على الفيروسات، بل تقضي على البكتيريا فقط.\n\n🧪 لا يوجد حتى يومنا هذا لقاح ولا دواء محدد للوقاية من فيروس كورونا أو علاجه\n"
    
    @IBOutlet weak var textView: UITextView!
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        
        textView.text = missUnderStand
        
    }
    
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
