//
//  ninthAnswersViewController.swift
//  covid-19
//
//  Created by a7med abu elre9al on 5/4/20.
//  Copyright © 2020 a7med abu elre9al. All rights reserved.
//

import UIKit

class ninthAnswersViewController: UIViewController {

    
    @IBOutlet weak var textView: UITextView!
    
    let answer9 = "لا تضع كمامة إلا إذا ظهرت عليك أعراض مرض كوفيد-19 (خاصة السعال) أو إذا كنت تقدم الرعاية لشخص يُحتمل أنه مصاب بهذا الـمرض. ولا يمكنك استعمال الكمامة وحيدة الاستعمال إلا مرة واحدة. أما إذا لم تكن مريضا أو قائما على رعاية شخص مريض، فستكون قد أهدرت كمامة دون داع. ونظرا للنقص في إمدادات الكمامات على الصعيد العالمي، فإن المنظمة تحث الناس على التحلي بالحكمة في استخدامها.\n\n وتنصح المنظمة باستخدام الكمامات الطبية استخداما رشيدا لتفادي إهدار الموارد الثمينة دون داع وإساءة استخدامها.\n\n وتتمثل السبل الأكثر فعّالية لحماية نفسك والآخرين من مرض كوفيد-19 في تنظيف يديك بشكل متكرر وتغطية الفم عند السعال بثني المرفق أو بمنديل ورقي، وترك مسافة لا تقل عن متر واحد (3 أقدام) عن الأشخاص الذين يسعلون أو يعطسون.\n\n 🚮  طريقة وضع الكمامة واستخدامها ونزعها والتخلص منها\n\n 1-       تذكر أن استخدام الكمامة ينبغي أن يقتصر على العاملين الصحيين ومقدمي الرعاية والأشخاص المصابين بأعراض تنفسية مثل الحمى والسعال.\n 2-       قبل لمس الكمامة، نظف يديك بفركهما بمطهر كحولي أو بغسلهما بالماء والصابون.\n 3-      أمسك الكمامة وافحصها للتأكد من أنها غير ممزقة أو مثقوبة.\n 4-      حدد الطرف العلوي من الكمامة (موضع الشريط المعدني).\n 5-      تأكد من توجيه الجانب الصحيح من الكمامة إلى الخارج (الجهة الملونة).\n 6-      ضع الكمامة على وجهك. اضغط على الشريط المعدني أو الطرف المقوى للكمامة ليتخذ شكل أنفك.\n 7-      اسحب الجزء السفلي من الكمامة لتغطي فمك وذقنك.\n 8-      بعد الاستخدام، اخلع الكمامة بنزع الشريط المطاطي من خلف الأذنين مبعداً الكمامة  عن وجهك وملابسك لتجنب ملامسة أجزاء الكمامة التي يحتمل أن تكون ملوثة.\n 9-      تخلص من الكمامة المستعملة على الفور برميها في صندوق نفايات مغلق.\n 10-  نظف يديك بعد ملامسة الكمامة أو رميها - أفركهما بمطهر كحولي، أو اغسلهما بالماء والصابون إذا كانتا متسختين بوضوح."
    
    override func viewDidLoad() {
        super.viewDidLoad()

        // Do any additional setup after loading the view.
        textView.text = answer9
    }
    @IBAction func backButtonAction(_ sender: Any) {
        
        dismiss(animated: true, completion: nil)
        
    }
    

    

}
